In [1]:
import pandas as pd
import numpy as np

# Series

In [ ]:
# Series

data = [1,2,3,4,5]
series = pd.Series(data)
print(f"Series:\n{series}") # aikhane 0 and 1 index hisebe by default thakbe
print(type(series))

Series:
0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [10]:
# Create a series from a dictionary

data = {
    "a":1,
    "b":2,
    "c":3
}
series_dict = pd.Series(data) # aikhane dictionary ar key gula index hisebe kaj korbe and value gula hobe oi index ar value

print(f"{series_dict}")

a    1
b    2
c    3
dtype: int64

In [11]:
# User define index

data = [1,2,3,4,5]
index = ["a", "b", "c", "d", "e"]
pd.Series(data, index=index)

a    1
b    2
c    3
d    4
e    5
dtype: int64

# DataFrame

In [98]:
# Dataframe
# Create a dataframe from a dictionary of list

data = {
    "Name":["Samin", "John", "Jack"],
    "Age":[25,32,40],
    "City":["Thakurgaon", "New York", "Austin"]
}

df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age        City
0  Samin   25  Thakurgaon
1   John   32    New York
2   Jack   40      Austin
<class 'pandas.core.frame.DataFrame'>

In [14]:
np.array(df)

array([['Samin', 25, 'Thakurgaon'],
       ['John', 32, 'New York'],
       ['Jack', 40, 'Austin']], dtype=object)

In [31]:
# Create a dataframe from a list of dictionary

data = [
    {"Name":"Samin","Age":25, "City":"Thakurgon"},
    {"Name":"Masud","Age":26, "City":"Dhaka"},
    {"Name":"John","Age":32, "City":"Austin"},
    {"Name":"Jacob","Age":42, "City":"Dallas"}
]
df = pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Samin   25  Thakurgon
1  Masud   26      Dhaka
2   John   32     Austin
3  Jacob   42     Dallas
<class 'pandas.core.frame.DataFrame'>

In [ ]:
df = pd.read_excel("vocab.xlsx")
print(df.head(1))

In [ ]:
df = pd.read_csv("vocab1.csv")
df.head(5)

In [ ]:
df.tail(5)

In [10]:
df = pd.read_csv("sales_data_sample.csv", encoding="ISO-8859-1")

df.head(5)

,ORDERNUMBER,QUANTITYORDERED,PRICEEACH,ORDERLINENUMBER,SALES,ORDERDATE,STATUS,QTR_ID,MONTH_ID,YEAR_ID,...,ADDRESSLINE1,ADDRESSLINE2,CITY,STATE,POSTALCODE,COUNTRY,TERRITORY,CONTACTLASTNAME,CONTACTFIRSTNAME,DEALSIZE
0,10107,30,95.70,2,2871.00,2/24/2003 0:00,Shipped,1,2,2003,...,897 Long Airport Avenue,NaN,NYC,NY,10022,USA,NaN,Yu,Kwai,Small
1,10121,34,81.35,5,2765.90,5/7/2003 0:00,Shipped,2,5,2003,...,59 rue de l'Abbaye,NaN,Reims,NaN,51100,France,EMEA,Henriot,Paul,Small
2,10134,41,94.74,2,3884.34,7/1/2003 0:00,Shipped,3,7,2003,...,27 rue du Colonel Pierre Avia,NaN,Paris,NaN,75508,France,EMEA,Da Cunha,Daniel,Medium
3,10145,45,83.26,6,3746.70,8/25/2003 0:00,Shipped,3,8,2003,...,78934 Hillside Dr.,NaN,Pasadena,CA,90003,USA,NaN,Young,Julie,Medium
4,10159,49,100.00,14,5205.27,10/10/2003 0:00,Shipped,4,10,2003,...,7734 Strong St.,NaN,San Francisco,CA,NaN,USA,NaN,Brown,Julie,Medium

In [82]:
# Accessing data from dataframe

data = {
    "Name": ["Samin", "John", "Jack"],
    "Age": [25, 32, 40],
    "City": ["Thakurgaon", "New York", "Austin"],
}

# Column wise accesss
df["Name"] #aivabe column ar name likhle full column take access korte pari and aita akta series a convert hoye jay

0    Samin
1     John
2     Jack
Name: Name, dtype: object

In [83]:
# Row wise access
# loc (Label-based Indexing)
# Uses explicit row and column labels.

# df.loc[0]
df.loc[1, "Age"]

np.int64(32)

In [84]:
# iloc (Integer-based Indexing)
# Uses zero-based integer positions.

df.iloc[1, 0]

'John'

In [85]:
df.at[1,"Age"]

np.int64(32)

In [86]:
df.iat[1,0]

'John'

# Data Manipulation with DataFrame

In [99]:
df

    Name  Age        City
0  Samin   25  Thakurgaon
1   John   32    New York
2   Jack   40      Austin

In [100]:
# Adding a new column

df["Salary"] = [50000, 30000, 40000]
df

    Name  Age        City  Salary
0  Samin   25  Thakurgaon   50000
1   John   32    New York   30000
2   Jack   40      Austin   40000

In [ ]:
# Remove an axis

df.drop("Salary") # aita error dibe cause drop a explicitly kono axis mention kore dewa na thakle default axis thake 0. 0 mane row, tai row a salary name ar kisu nai fole error dibe

In [101]:
df.drop("Salary", axis=1) # drop permanent operation na. ai ta dataframe k save kore rakhe na. tai aber df print korle Salary column chole ashbe

    Name  Age        City
0  Samin   25  Thakurgaon
1   John   32    New York
2   Jack   40      Austin

In [102]:
df

    Name  Age        City  Salary
0  Samin   25  Thakurgaon   50000
1   John   32    New York   30000
2   Jack   40      Austin   40000

In [103]:
df.drop("Salary", axis=1, inplace=True) #inplace true korle drop ar operation permanent hobe

In [73]:
df

    Name  Age        City
0  Samin   25  Thakurgaon
1   John   32    New York
2   Jack   40      Austin

In [104]:
# Adding age to the column

df["Age"] = df["Age"] + 1
df

    Name  Age        City
0  Samin   26  Thakurgaon
1   John   33    New York
2   Jack   41      Austin

In [105]:
df.drop(2, inplace=True)
df

    Name  Age        City
0  Samin   26  Thakurgaon
1   John   33    New York